# EnableConceptualEnergyAnalyticalModel Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
EnergyDataSettings..::..EnableConceptualEnergyAnalyticalModel Method
EnergyDataSettings Class See Also
---
Turns on functionality related to conceptual energy analysis.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool EnableConceptualEnergyAnalyticalModel()
```

Visual Basic
---
```text
Public Shared Function EnableConceptualEnergyAnalyticalModel As Boolean
```

Visual C++
---
```text
public:
static bool EnableConceptualEnergyAnalyticalModel()
```

# ### Return Value
Returns true if the Conceptual Energy Analytical model is turned on, false otherwise.
# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace